TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_wwdt0.h
/*****************************************************************************

  Copyright (C) 2025 Texas Instruments Incorporated - http://www.ti.com/ 

  Redistribution and use in source and binary forms, with or without 
  modification, are permitted provided that the following conditions 
  are met:

   Redistributions of source code must retain the above copyright 
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the 
   documentation and/or other materials provided with the   
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

#ifndef ti_devices_msp_peripherals_hw_wwdt0__include
#define ti_devices_msp_peripherals_hw_wwdt0__include

/* Filename: hw_wwdt0.h */
/* Revised: 2025-04-09 13:57:08 */
/* Revision: f4602b816b1643a266cc7aae6be755d35f394359 */

#ifndef __CORTEX_M
  #ifdef __cplusplus
    #define __I  volatile        /*!< Defines 'read only' permissions */
  #else
    #define __I  volatile const  /*!< Defines 'read only' permissions */
  #endif
  #define __O  volatile          /*!< Defines 'write only' permissions */
  #define __IO  volatile         /*!< Defines 'read / write' permissions */

  /* following defines should be used for structure members */
  #define __IM  volatile const   /*! Defines 'read only' structure member permissions */
  #define __OM  volatile         /*! Defines 'write only' structure member permissions */
  #define __IOM  volatile        /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

#if defined ( __CC_ARM )
#pragma anon_unions
#endif

/******************************************************************************
* WWDT0 Registers
******************************************************************************/
#define WWDT0_CPU_INT_OFS                        ((uint32_t)0x00001020U)
#define WWDT0_GPRCM_OFS                          ((uint32_t)0x00000800U)


/** @addtogroup WWDT0_CPU_INT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00001020) Interrupt index */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00001028) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001030) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001038) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00001040) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00001048) Interrupt clear */
} WWDT0_CPU_INT_Regs;

/*@}*/ /* end of group WWDT0_CPU_INT */

/** @addtogroup WWDT0_GPRCM
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00000800) Power enable */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00000804) Reset Control */
       uint32_t RESERVED0[3];
  __I  uint32_t STAT;                              /* !< (@ 0x00000814) Status Register */
} WWDT0_GPRCM_Regs;

/*@}*/ /* end of group WWDT0_GPRCM */

/** @addtogroup WWDT0
  @{
*/

typedef struct {
       uint32_t RESERVED0[512];
  WWDT0_GPRCM_Regs  GPRCM;                             /* !< (@ 0x00000800) */
       uint32_t RESERVED1[512];
  __IO uint32_t PDBGCTL;                           /* !< (@ 0x00001018) Peripheral Debug Control */
       uint32_t RESERVED2;
  WWDT0_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x00001020) */
       uint32_t RESERVED3[37];
  __IO uint32_t EVT_MODE;                          /* !< (@ 0x000010E0) Event Mode */
       uint32_t RESERVED4[6];
  __I  uint32_t DESC;                              /* !< (@ 0x000010FC) Module Description */
  __IO uint32_t WWDTCTL0;                          /* !< (@ 0x00001100) Window Watchdog Timer Control Register 0 */
  __IO uint32_t WWDTCTL1;                          /* !< (@ 0x00001104) Window Watchdog Timer Control Register 0 */
  __IO uint32_t WWDTCNTRST;                        /* !< (@ 0x00001108) Window Watchdog Timer Counter Reset Register */
  __I  uint32_t WWDTSTAT;                          /* !< (@ 0x0000110C) Window Watchdog Timer Status Register */
} WWDT0_Regs;

/*@}*/ /* end of group WWDT0 */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* WWDT0 Register Control Bits
******************************************************************************/

/* WWDT0_IIDX Bits */
/* WWDT0_IIDX[STAT] Bits */
#define WWDT0_IIDX_STAT_OFS                      (0)                             /* !< STAT Offset */
#define WWDT0_IIDX_STAT_MASK                     ((uint32_t)0x0000001FU)         /* !< Module Interrupt Vector Value.
                                                                                    This register provides the highest
                                                                                    priority interrupt index. A read
                                                                                    clears the corresponding interrupt
                                                                                    flag in RIS and MISC. */
#define WWDT0_IIDX_STAT_NO_INTR                  ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define WWDT0_IIDX_STAT_INTTIM                   ((uint32_t)0x00000001U)         /* !< Interval Timer Interrupt; Interrupt
                                                                                    Flag: INTTIM; Interrupt Priority:
                                                                                    Highest */

/* WWDT0_IMASK Bits */
/* WWDT0_IMASK[INTTIM] Bits */
#define WWDT0_IMASK_INTTIM_OFS                   (0)                             /* !< INTTIM Offset */
#define WWDT0_IMASK_INTTIM_MASK                  ((uint32_t)0x00000001U)         /* !< Interval Timer Interrupt. */
#define WWDT0_IMASK_INTTIM_CLR                   ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define WWDT0_IMASK_INTTIM_SET                   ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */

/* WWDT0_RIS Bits */
/* WWDT0_RIS[INTTIM] Bits */
#define WWDT0_RIS_INTTIM_OFS                     (0)                             /* !< INTTIM Offset */
#define WWDT0_RIS_INTTIM_MASK                    ((uint32_t)0x00000001U)         /* !< Interval Timer Interrupt. */
#define WWDT0_RIS_INTTIM_CLR                     ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define WWDT0_RIS_INTTIM_SET                     ((uint32_t)0x00000001U)         /* !< Interrupt occurred */

/* WWDT0_MIS Bits */
/* WWDT0_MIS[INTTIM] Bits */
#define WWDT0_MIS_INTTIM_OFS                     (0)                             /* !< INTTIM Offset */
#define WWDT0_MIS_INTTIM_MASK                    ((uint32_t)0x00000001U)         /* !< Interval Timer Interrupt. */
#define WWDT0_MIS_INTTIM_CLR                     ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define WWDT0_MIS_INTTIM_SET                     ((uint32_t)0x00000001U)         /* !< Interrupt occurred */

