TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_wwdt0.h
/* WWDT0_ISET Bits */
/* WWDT0_ISET[INTTIM] Bits */
#define WWDT0_ISET_INTTIM_OFS                    (0)                             /* !< INTTIM Offset */
#define WWDT0_ISET_INTTIM_MASK                   ((uint32_t)0x00000001U)         /* !< Interval Timer Interrupt. */
#define WWDT0_ISET_INTTIM_NO_EFFECT              ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define WWDT0_ISET_INTTIM_SET                    ((uint32_t)0x00000001U)         /* !< Set Interrupt */

/* WWDT0_ICLR Bits */
/* WWDT0_ICLR[INTTIM] Bits */
#define WWDT0_ICLR_INTTIM_OFS                    (0)                             /* !< INTTIM Offset */
#define WWDT0_ICLR_INTTIM_MASK                   ((uint32_t)0x00000001U)         /* !< Interval Timer Interrupt. */
#define WWDT0_ICLR_INTTIM_NO_EFFECT              ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define WWDT0_ICLR_INTTIM_CLR                    ((uint32_t)0x00000001U)         /* !< Clear Interrupt */

/* WWDT0_PWREN Bits */
/* WWDT0_PWREN[ENABLE] Bits */
#define WWDT0_PWREN_ENABLE_OFS                   (0)                             /* !< ENABLE Offset */
#define WWDT0_PWREN_ENABLE_MASK                  ((uint32_t)0x00000001U)         /* !< Enable the power Note: For safety
                                                                                    devices the power cannot be disabled
                                                                                    once enabled. */
#define WWDT0_PWREN_ENABLE_DISABLE               ((uint32_t)0x00000000U)         /* !< Disable Power */
#define WWDT0_PWREN_ENABLE_ENABLE                ((uint32_t)0x00000001U)         /* !< Enable Power */
/* WWDT0_PWREN[KEY] Bits */
#define WWDT0_PWREN_KEY_OFS                      (24)                            /* !< KEY Offset */
#define WWDT0_PWREN_KEY_MASK                     ((uint32_t)0xFF000000U)         /* !< KEY to allow Power State Change */
#define WWDT0_PWREN_KEY_UNLOCK_W                 ((uint32_t)0x26000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* WWDT0_RSTCTL Bits */
/* WWDT0_RSTCTL[RESETSTKYCLR] Bits */
#define WWDT0_RSTCTL_RESETSTKYCLR_OFS            (1)                             /* !< RESETSTKYCLR Offset */
#define WWDT0_RSTCTL_RESETSTKYCLR_MASK           ((uint32_t)0x00000002U)         /* !< Clear [GPRCM.STAT.RESETSTKY] */
#define WWDT0_RSTCTL_RESETSTKYCLR_NOP            ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define WWDT0_RSTCTL_RESETSTKYCLR_CLR            ((uint32_t)0x00000002U)         /* !< Clear reset sticky bit */
/* WWDT0_RSTCTL[RESETASSERT] Bits */
#define WWDT0_RSTCTL_RESETASSERT_OFS             (0)                             /* !< RESETASSERT Offset */
#define WWDT0_RSTCTL_RESETASSERT_MASK            ((uint32_t)0x00000001U)         /* !< Assert reset to the peripheral
                                                                                    Note: For safety devices a watchdog
                                                                                    reset by software is not possible. */
#define WWDT0_RSTCTL_RESETASSERT_NOP             ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define WWDT0_RSTCTL_RESETASSERT_ASSERT          ((uint32_t)0x00000001U)         /* !< Assert reset */
/* WWDT0_RSTCTL[KEY] Bits */
#define WWDT0_RSTCTL_KEY_OFS                     (24)                            /* !< KEY Offset */
#define WWDT0_RSTCTL_KEY_MASK                    ((uint32_t)0xFF000000U)         /* !< Unlock key */
#define WWDT0_RSTCTL_KEY_UNLOCK_W                ((uint32_t)0xB1000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* WWDT0_STAT Bits */
/* WWDT0_STAT[RESETSTKY] Bits */
#define WWDT0_STAT_RESETSTKY_OFS                 (16)                            /* !< RESETSTKY Offset */
#define WWDT0_STAT_RESETSTKY_MASK                ((uint32_t)0x00010000U)         /* !< This bit indicates, if the
                                                                                    peripheral was reset, since this bit
                                                                                    was cleared by RESETSTKYCLR in the
                                                                                    RSTCTL register */
#define WWDT0_STAT_RESETSTKY_NORES               ((uint32_t)0x00000000U)         /* !< The peripheral has not been reset
                                                                                    since this bit was last cleared by
                                                                                    RESETSTKYCLR in the RSTCTL register */
#define WWDT0_STAT_RESETSTKY_RESET               ((uint32_t)0x00010000U)         /* !< The peripheral was reset since the
                                                                                    last bit clear */

/* WWDT0_PDBGCTL Bits */
/* WWDT0_PDBGCTL[FREE] Bits */
#define WWDT0_PDBGCTL_FREE_OFS                   (0)                             /* !< FREE Offset */
#define WWDT0_PDBGCTL_FREE_MASK                  ((uint32_t)0x00000001U)         /* !< Free run control */
#define WWDT0_PDBGCTL_FREE_STOP                  ((uint32_t)0x00000000U)         /* !< The peripheral freezes
                                                                                    functionality while the Core Halted
                                                                                    input is asserted and resumes when it
                                                                                    is deasserted. */
#define WWDT0_PDBGCTL_FREE_RUN                   ((uint32_t)0x00000001U)         /* !< The peripheral ignores the state of
                                                                                    the Core Halted input */

